# Используем официальный образ Node.js в качестве базового
FROM node:18-alpine

# Устанавливаем рабочую директорию в контейнере
WORKDIR /app

# Копируем файлы package.json и package-lock.json в контейнер
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем остальные файлы приложения в контейнер
COPY . .

# Собираем приложение
RUN npm run build

# Открываем порт, который будет использоваться для доступа к приложению
EXPOSE 6060

# Определяем команду для запуска приложения
CMD ["npm", "start"]
